opcode 68 -- (call)вызов процедуры, дальше ее адрес (скорее всего 4 байта)
opcode 90h -- nop(нет операции)

EB -- код безусловного перехода (jmp)
olly:
правая кнопка мыши -> search for -> all intermodular calls

распаковка программы:
открываем в OllyDbg
нам нужно найти OEP (Original Entry Point) в программу, которая была упакована

нам нужно "подождать" пока упаковщик распакует исходную программу 
и найти ту точку, где начинается наша исходная программа

как найти OEP ?
(на примере UPX)
мы видим, что в начале кода упаковщика есть команда PUSHAD -- записывает в стек значения всех регистров общего назначения

тогда поставим прерывание на доступ к ячейке памяти, находящейся выше по стеку
на одну строчку вверх

находим OEP

теперь дампим exe при помощи PETools

полученный exe файл не будет запускаться, для того, чтобы он запустился нужно
подправить OEP, а также восстановить таблицу импорта

для этого есть хороший инструмент ImpREC

после получения fix'а его можно оптимизировать, так как в нем очень много пустых областей

используем PETools -> Rebuild PE
